In [1]:
import pandas as pd

In [2]:
data = [['Juan', 25], ['Behisy', 44], ['Sophi', 17]]
print (type(data))

<class 'list'>

In [3]:
df = pd.DataFrame(data, columns=['nombre', 'edad'])

In [4]:
df

   nombre  edad
0    Juan    25
1  Behisy    44
2   Sophi    17

In [5]:
#Diccionario

In [6]:
data = {'nombre':['Juan', 'Behisy', 'Sophi'],
        'edad':[25,44,17]}
print(type(data))

<class 'dict'>

In [7]:
df = pd.DataFrame(data)

In [8]:
df

   nombre  edad
0    Juan    25
1  Behisy    44
2   Sophi    17

In [9]:
#Lista de Tuplas

In [10]:
data = [('Juan', 25), ('Behisy', 44), ('Sophi', 17)]

In [11]:
df = pd.DataFrame(data, columns=['nombre','edad'])

In [12]:
df

   nombre  edad
0    Juan    25
1  Behisy    44
2   Sophi    17

In [13]:
#Leer un archivo

In [14]:
df = pd.read_csv('../data/data', sep='|')

In [15]:
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [17]:
df = pd.read_csv('../data/data')

In [18]:
df

   nombre|edad|ciudad
0        Juan||Madrid
1  María|30|Barcelona
2    Pedro|35|Sevilla

In [20]:
df = pd.read_csv('../data/data.csv')

In [21]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [22]:
df = pd.read_csv('../data/data_without_header')

In [23]:
df

    Juan  25     Madrid
0  María  30  Barcelona
1  Pedro  35    Sevilla

In [24]:
df = pd.read_csv('../data/data.csv', header = None)

In [25]:
df

        0     1          2
0  nombre  edad     ciudad
1    Juan    25     Madrid
2   María    30  Barcelona
3   Pedro    35    Sevilla

In [26]:
df = pd.read_csv('../data/data.csv', header = None, names = ["nombre","edad","ciudad"])

In [27]:
df

   nombre  edad     ciudad
0  nombre  edad     ciudad
1    Juan    25     Madrid
2   María    30  Barcelona
3   Pedro    35    Sevilla

In [28]:
df = pd.read_json('../data/data.json')

In [30]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [ ]:
#Trae los primeros datos

In [31]:
df.head(2)

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [ ]:
#Trae los ultimos datos

In [32]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [33]:
# Trae Estadistica

In [34]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [35]:
#Trae informacion de cuantas filas y columnas tiene

In [36]:
df.shape

(3, 3)

In [37]:
df['nombre']

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [39]:
df[['nombre', 'edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [ ]:
# Obtener informacion del df en base al index

In [48]:
df.loc[1]

nombre        María
edad             30
ciudad    Barcelona
Name: 1, dtype: object

In [ ]:
#Extraer Fila y columna especifica

In [43]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [ ]:
# Extraer bajo una condicion

In [47]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [49]:
#Ejemplo de Agrupaciones

In [50]:
data = {
    'grupo':['A','B','A','B','A','B'],
    'valor':['10','15','25','12','27','33']
}

In [67]:
df = pd.DataFrame(data)

In [68]:
df

  grupo valor
0     A    10
1     B    15
2     A    25
3     B    12
4     A    27
5     B    33

In [55]:
df.groupby('grupo').sum()

        valor
grupo
A      102527
B      151233

In [60]:
#Borrar Información (eliminar, completar valores faltantes)

In [61]:
import numpy as np

In [70]:
data1 = {
    'A': [1,2,None,4],
    'B': [4, None,5,7]
}

df=pd.DataFrame(data1)

In [71]:
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [73]:
df_lleno = df.fillna(value='0')
df_lleno

     A    B
0  1.0  4.0
1  2.0    0
2    0  5.0
3  4.0  7.0

In [75]:
df_sin_na = df.dropna()
df_sin_na

     A    B
0  1.0  4.0
3  4.0  7.0

In [76]:
#Funciones: Tener codigo ordenado y no repetitivo

In [77]:
def suma(a,b):
    return a+b

In [78]:
df['suma']=df['A']+df['B']

In [79]:
df

     A    B  suma
0  1.0  4.0   5.0
1  2.0  NaN   NaN
2  NaN  5.0   NaN
3  4.0  7.0  11.0

In [80]:
df['dobleA'] = df['A'].apply(lambda x: x*2)
df

     A    B  suma  dobleA
0  1.0  4.0   5.0     2.0
1  2.0  NaN   NaN     4.0
2  NaN  5.0   NaN     NaN
3  4.0  7.0  11.0     8.0

In [81]:
def doble(x):
    return x*2

In [82]:
df['dobleB'] = df['B'].apply(doble)

In [83]:
df

     A    B  suma  dobleA  dobleB
0  1.0  4.0   5.0     2.0     8.0
1  2.0  NaN   NaN     4.0     NaN
2  NaN  5.0   NaN     NaN    10.0
3  4.0  7.0  11.0     8.0    14.0

In [84]:
df['suma2']=df.apply(lambda row: row['A']+ row['B'], axis=1)
df

     A    B  suma  dobleA  dobleB  suma2
0  1.0  4.0   5.0     2.0     8.0    5.0
1  2.0  NaN   NaN     4.0     NaN    NaN
2  NaN  5.0   NaN     NaN    10.0    NaN
3  4.0  7.0  11.0     8.0    14.0   11.0